# CloudPoint Type Conversions (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CloudPoint Type Conversions
CloudPoint Structure See Also
---
The CloudPoint type exposes the following members.
# Operators
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ImplicitWideningImplicitImplicitImplicit(CloudPoint to XYZ) | Creates an XYZ object from this point cloud. |

# See Also
CloudPoint Structure
Autodesk.Revit.DB.PointClouds Namespace